package array_quiz;
/*
  문제.  다음은 배열을 선언하거나 초기화 한것이다.
        잘못된 것을 고르고 그 이유를 작성하시오.   
        
        1.  int[] arr[];	올바른 구문
        	
        	풀이: 2차원 배열 메모리 주소번지를 담을 참조변수를 선언할때
        		int[][]	arr;
        		int[]	arr[];
        		int		arr[][];
        	
        2.  int[] arr = {1,2,3,}; 올바른 구문
        	풀이: 마지막의 쉼표 , 는 작성해도 상관 없음
        	
        3.  int[] arr = new int[5];	올바른 구문
        
        4.  int[] arr = new int[5]{1,2,3,4,5};	잘못된 구문
        	
        	풀이: 두번째 대괄호[5]에 숫자를 넣으면 안된다.
        		두번째 대괄호 []안에 배열의 크기를 지정할 수 없음
        		괄호 {}안의 데이터의 갯수에 따라 자동적으로 배열의 크기(칸수)가 결정되기 때문.
                   
        5.  int arr[5];	잘못된 구문
        	
        	풀이: 배열 메모리의 주소를 담을 참조변수 arr 선언에 배열크기 지정할 수 없음
        
        6.  int[] arr[] = new int[3][];  올바른 구문 
        	
        	풀이: 동적 2차원 배열 함수

*/


public class test5 {

	public static void main(String[] args) {

	}

}
