/*
동적타이핑 방식:    
    동적 타이핑은 변수를 선언할 때 자료형을 미리 정하지 않고, 
    코드 실행 중에 변수에 대입되는 값에 따라 자료형이 결정되는 방식이다. 

보충 설명1:
    JavaScript에서는 let num = 10;이라고 해도 num이 int(정수) 타입으로 고정되는 것이 아니라, 
    현재 num에 들어있는 값이 number 타입인 것이다. 
    이후 문자열을 넣으면 string 타입 값을 가진 변수처럼 동작한다.

보충 설명2:
    Java나 C언어는 변수를 만들 때 자료형을 보고 필요한 메모리 크기를 어느 정도 예측할 수 있다.
    하지만 JavaScript는 변수 선언 시 자료형을 적지 않기 때문에, 개발자가 변수의 메모리 크기를 직접 정하는 방식이 아니다.
    대신 실행 중에 값의 종류를 보고 JavaScript 엔진이 내부적으로 관리한다.



  주제(동적타이핑 단점) : 
    개발자가 변수의 값 (자료형)이 변경되었다는 사실을 모르고
    코드를 작성하면 프로그램이 의도치 않게 동작하거나
    오류가 발생할수 있습니다.
*/

let varA = 1;

// 여기에 100줄 코드가 존재 한다고 생각 해보세요..
//....
//......
//........
//..............
//.................
//.......................

varA = '이정환';

// 여기에 100줄 코드가 존재 한다고 생각 해보세요..
//....
//......
//........
//..............
//.................
//.......................

//변수 varA에 값을 숫자형으로 오인하고
//++ 전위 증가 연산자를 사용했습니다.
//이 경우 NaN을 출력하여 의도 한대로 2라는 값이 출력 되지 않습니다.
console.log(  ++varA  ); // NaN -> Not a Number

//위 상황을 대비해서 변수varA에 어떤 자료형이 저장되어 있는지
//자료형을 확인하고 그다음에 계산식을 적어 주자
console.log( typeof varA); //string